export/issues/8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-05 Fri 13:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PLN CDR draft: Issue 8</title>
<meta name="author" content="Gleefre" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">PLN CDR draft: Issue 8</h1>

<div id="outline-container-issue-8" class="outline-2">
<h2 id="issue-8"><span class="section-number-2">1.</span> Issue 8 (Interaction with FORMAT)</h2>
<div class="outline-text-2" id="text-issue-8">
<p>
<i>by |3b|</i>
</p>
</div>
<div id="outline-container-org8e22787" class="outline-3">
<h3 id="org8e22787"><span class="section-number-3">1.1.</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
It is not clear how <i>local nicknames</i> should affect <code>format</code>'s <code>\~//</code> directive.
</p>

<p>
First, it would be inconvinient if it wouldn't be possible to use <i>local
nicknames</i> with the <code>\~//</code> directive.
</p>

<p>
Secondly, it would be unintuitive if the function used would depend on the
<i>current package</i> at the <b>execution</b> time. This also might break [existing] code,
if a local nickname in the <i>current package</i> shadows a package that contains a
function used by a control string in another function.
</p>

<p>
Finally, if the call to <code>format</code> is not compiled, it is hard to impossible to find
the function using <i>local nicknames</i> of the package that was the <i>current package</i>
at the <b>compile</b> time.
</p>
</div>
</div>
<div id="outline-container-orga8e9fb1" class="outline-3">
<h3 id="orga8e9fb1"><span class="section-number-3">1.2.</span> Examples</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-common-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defpackage</span> <span style="color: #e5786d;">#:foo-a</span> (<span style="color: #e5786d;">:use</span>) (<span style="color: #e5786d;">:export</span> <span style="color: #e5786d;">#:ff</span>))
(<span style="color: #8ac6f2; font-weight: bold;">defpackage</span> <span style="color: #e5786d;">#:foo-b</span> (<span style="color: #e5786d;">:use</span>) (<span style="color: #e5786d;">:export</span> <span style="color: #e5786d;">#:ff</span>))

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">foo-a:ff</span> (stream <span style="color: #92a65e; font-weight: bold;">&amp;rest</span> args)
  (<span style="color: #8ac6f2; font-weight: bold;">declare</span> (ignore args))
  (format stream <span style="color: #95e454;">"FOO-A:FF"</span>))

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">foo-b:ff</span> (stream <span style="color: #92a65e; font-weight: bold;">&amp;rest</span> args)
  (<span style="color: #8ac6f2; font-weight: bold;">declare</span> (ignore args))
  (format stream <span style="color: #95e454;">"FOO-B:FF"</span>))

(<span style="color: #8ac6f2; font-weight: bold;">defpackage</span> <span style="color: #e5786d;">#:bar-a</span>
  (<span style="color: #e5786d;">:use</span> <span style="color: #e5786d;">#:cl</span>)
  (<span style="color: #e5786d;">:local-nicknames</span> (<span style="color: #e5786d;">#:nick</span> <span style="color: #e5786d;">#:foo-a</span>)))

(<span style="color: #8ac6f2; font-weight: bold;">defpackage</span> <span style="color: #e5786d;">#:bar-b</span>
  (<span style="color: #e5786d;">:use</span> <span style="color: #e5786d;">#:cl</span>)
  (<span style="color: #e5786d;">:local-nicknames</span> (<span style="color: #e5786d;">#:nick</span> <span style="color: #e5786d;">#:foo-b</span>)))

(<span style="color: #8ac6f2; font-weight: bold;">in-package</span> <span style="color: #e5786d;">#:bar-a</span>)

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">test</span> ()
  (format t <span style="color: #95e454;">"Called ~/nick:ff/ &amp; "</span> nil)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((*package* (find-package (quote <span style="color: #e5786d;">#:bar-a</span>))))  <span style="color: #99968b;">; or #.*package*</span>
    (format t <span style="color: #95e454;">"~/nick:ff/~%"</span> nil)))

(test)
<span style="color: #99968b;">; </span><span style="color: #99968b;">=&gt; "Called FOO-A:FF &amp; FOO-A:FF"  (sbcl, ccl, ecl, acl, abcl, clasp)</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">lispworks errors (NICK package not found)</span>
(<span style="color: #8ac6f2; font-weight: bold;">let</span> ((*package* (find-package (quote <span style="color: #e5786d;">#:bar-b</span>))))
  (test))
<span style="color: #99968b;">; </span><span style="color: #99968b;">=&gt; "Called FOO-A:FF &amp; FOO-A:FF"  (sbcl, clasp)</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">=&gt; "Called FOO-B:FF &amp; FOO-A:FF"  (ccl, ecl, acl, abcl)</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">lispworks errors (NICK package not found)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga21db8f" class="outline-3">
<h3 id="orga21db8f"><span class="section-number-3">1.3.</span> Proposal NO-LOCAL-NICKNAMES</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>format</code>'s <code>\~//</code> directive must <b>not</b> use <i>local nicknames</i> of any package when
looking up the specified symbol.
</p>

<p>
Rationale: In the spirit of how when the package is not specified, the symbol is
not looked up in the <i>current package</i>, but instead in the <code>#:CL-USER</code> package;
the <i>tilde slash</i> directive should not depend on the value of <code>*package*</code> at any
time.  Specifying it to use <i>local nicknames</i> of the <code>#:CL-USER</code> package instead
would risk breaking the existing code when adding local nicknames to that package.
</p>
</div>
</div>
<div id="outline-container-orgdf87901" class="outline-3">
<h3 id="orgdf87901"><span class="section-number-3">1.4.</span> Links</h3>
<div class="outline-text-3" id="text-1-4">
<p>
See <a href="https://www.lispworks.com/documentation/HyperSpec/Body/22_ced.htm">CLHS 22.3.5.4 Tilde Slash: Call Function</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gleefre</p>
<p class="date">Created: 2024-07-05 Fri 13:32</p>
</div>
</body>
</html>
